{
  "pageNotFound": "Oops! Page Not Found",
  "pageNotFoundDesc": "Sorry, we couldn't find the page you were looking for.",
  "forbidden": "Oops! Access Denied",
  "forbiddenDesc": "Sorry, but you don't have permission to access this page.",
  "internalError": "Oops! Something Went Wrong",
  "internalErrorDesc": "Sorry, but the server encountered an error.",
  "offline": "Offline Page",
  "offlineError": "Oops! Network Error",
  "offlineErrorDesc": "Sorry, can't connect to the internet. Check your connection.",
  "comingSoon": "Coming Soon",
  "operationSuccess": "Operation Success",
  "operationFailed": "Operation failed",
  "sureDelete": "Are you sure you want to delete?",
  "http": {
    "requestTimeout": "The request timed out. Please try again later.",
    "networkError": "A network error occurred. Please check your internet connection and try again.",
    "badRequest": "Bad Request. Please check your input and try again.",
    "unauthorized": "Unauthorized. Please log in to continue.",
    "forbidden": "Forbidden. You do not have permission to access this resource.",
    "notFound": "Not Found. The requested resource could not be found.",
    "internalServerError": "Internal Server Error. Something went wrong on our end. Please try again later.",
    "rolePermisstionsUpdate": "The role permissions of the current account have been updated. Please log in again.",
    "loginOtherDevice": "Login again on another device, please login again.",
    "errMsg401": "The user does not have permission (token, user name, password error)!",
    "errMsg403": "The user is authorized, but access is forbidden!",
    "errMsg404": "Network request error, the resource was not found!",
    "errMsg405": "Network request error, request method not allowed!",
    "errMsg408": "Network request timed out!",
    "errMsg500": "Server error, please contact the administrator!",
    "errMsg501": "The network is not implemented!",
    "errMsg502": "Network Error!",
    "errMsg503": "The service is unavailable, the server is temporarily overloaded or maintained!",
    "errMsg504": "Network timeout!",
    "errMsg505": "The http version does not support the request!"
  }
}
